{
  "updatedAt": "2025-08-01",
  "currency": "USD",
  "products": [
    {
      "id": "midnight-dream",
      "name": "🦋 MIDNIGHT DREAM 🦋",
      "price": 19.99,
      "category": "Hijab",
      "brand": "Salaamira",
      "rating": 4.6,
      "reviews": 184,
      "stock": 42,
      "featured": true,
      "new": false,
      "description": "The rich royal blue creates a bold, sophisticated base, while the swirling gold marble accents add a touch of luxury and elegance.  It’s perfect for those who want to add a bit of luxury to their everyday style or stand out at a special event. The soft fabric drapes beautifully and feels incredibly comfortable, so you can look and feel your best all day long. <br><br> Material: 100% Modal. <br><br>This hijab is not only stylish but also easy to care for. Simply hand wash it in cold water and hang it to dry for long-lasting softness and color. ",
      "image": "./assets/images/MIDNIGHTDREAM2.webp"
    },
    {
      "id": "vintage-flora",
      "name": "⚜️VINTAGE FLORA⚜️",
      "price": 19.99,
      "category": "Hijab",
      "brand": "Salaamira",
      "rating": 4.6,
      "reviews": 184,
      "stock": 42,
      "featured": true,
      "new": false,
      "description": "Add a touch of elegance to your day with this mint and gold floral hijab. The soft mint green blends beautifully with the subtle gold accents, creating a look that’s both fresh and classy. The vintage-inspired floral pattern gives it a timeless, feminine feel that pairs effortlessly with any outfit, whether you’re dressing up or keeping it casual. Made from soft, breathable modal fabric, it’s comfortable to wear all day long. <br><br> Material: 100% Modal. <br><br>This hijab is not only stylish but also easy to care for. Simply hand wash it in cold water and hang it to dry for long-lasting softness and color.",
      "image": "./assets/images/VINTAGEFLORA.webp"
    },
    {
      "id": "pookie",
      "name": "🎀 POOKIE 🎀",
      "price": 19.99,
      "category": "Hijab",
      "brand": "Salaamira",
      "rating": 4.6,
      "reviews": 184,
      "stock": 42,
      "featured": true,
      "new": false,
      "description": "Bring a touch of sweetness to your style with this white hijab featuring delicate pink roses and bows all over. The soft white base creates a fresh, clean look, while the pink roses and playful bows add a fun, feminine charm. The soft, lightweight fabric makes it comfy to wear all day, and the pretty floral design is sure to make you feel as beautiful as you look! <br><br> Material: 100% Modal. <br><br>This hijab is not only stylish but also easy to care for. Simply hand wash it in cold water and hang it to dry for long-lasting softness and color.",
      "image": "./assets/images/POOKIE_e668edcd-c51d-4b81-8719-9973d66796ee.webp"
    },
    {
      "id": "color-pop",
      "name": "🌺 COLOR POP 🌺",
      "price": 19.99,
      "category": "Hijab",
      "brand": "Salaamira",
      "rating": 4.6,
      "reviews": 184,
      "stock": 42,
      "featured": true,
      "new": false,
      "description": "This floral pink mauve hijab is giving major vibes! The soft pink and mauve shades mixed with cute floral prints make it the perfect way to add some color to your outfit without overdoing it. Whether you’re out with friends, running errands, or dressing up for a casual event, this hijab will keep you looking fresh and on-trend. The fabric is light and comfy, so you can rock it all day without a worry. It’s the go-to piece that’s all about effortless style and a pop of personality. <br><br> Material: 100% Modal. <br><br>This hijab is not only stylish but also easy to care for. Simply hand wash it in cold water and hang it to dry for long-lasting softness and color.",
      "image": "./assets/images/COLORPOP2.webp"
    },
    {
      "id": "ombrelicious",
      "name": "💖OMBRÉLICIOUS💖",
      "price": 19.99,
      "category": "Hijab",
      "brand": "Salaamira",
      "rating": 4.6,
      "reviews": 184,
      "stock": 42,
      "featured": true,
      "new": false,
      "description": "Add a pop of color to your wardrobe with this soft pink ombre hijab! Featuring a smooth gradient that blends from a light, airy pink to a deeper, richer shade, it creates a look that's both sweet and stylish. Perfect for girls who love a little bit of flair, this hijab is soft, lightweight, and comfortable, making it ideal for all-day wear. Whether you’re dressing up for a special occasion or adding a fun twist to your everyday outfits, this soft pink ombre hijab is sure to brighten up your look with a touch of playful charm! <br><br> Material: 100% Modal. <br><br>This hijab is not only stylish but also easy to care for. Simply hand wash it in cold water and hang it to dry for long-lasting softness and color.",
      "image": "./assets/images/OBRELICIOUS-1_7748dddf-3fff-4ce7-a8d2-f1f22301ddb3.webp"
    },
    {
      "id": "cherry-red",
      "name": "🍒 CHERRY RED 🍒",
      "price": 19.99,
      "category": "Hijab",
      "brand": "Salaamira",
      "rating": 4.6,
      "reviews": 184,
      "stock": 42,
      "featured": true,
      "new": false,
      "description": "Turn up the drama with this black and cherry red ombre hijab! The rich, deep black gradually transitions into a vibrant cherry red, creating a beautiful gradient that adds a touch of drama and sophistication to any outfit. It’s the perfect mix of edgy and chic. <br><br> Material: 100% Modal. <br><br>This hijab is not only stylish but also easy to care for. Simply hand wash it in cold water and hang it to dry for long-lasting softness and color.",
      "image": "./assets/images/CHERRYRED1.webp"
    },
    {
      "id": "demure",
      "name": "🥀 DEMURE 🥀",
      "price": 19.99,
      "category": "Hijab",
      "brand": "Salaamira",
      "rating": 4.6,
      "reviews": 184,
      "stock": 42,
      "featured": true,
      "new": false,
      "description": "This beige and black hijab is all about effortless style. The neutral beige with subtle black details gives you that chill, classy vibe that works with basically everything. It’s simple, but it still makes a statement—perfect for when you want to look put together without trying too hard. Whether you’re headed to class, hanging out, or going to an event, this hijab is comfy, versatile, and gives off major cool-girl energy. A must-have for keeping your style lowkey but still on point! <br><br> Material: 100% Modal. <br><br>This hijab is not only stylish but also easy to care for. Simply hand wash it in cold water and hang it to dry for long-lasting softness and color.",
      "image": "./assets/images/demure.webp"
    },
    {
      "id": "salaam-exclusive",
      "name": "🕊️ SALAAM EXCLUSIVE 🕊️",
      "price": 19.99,
      "category": "Hijab",
      "brand": "Salaamira",
      "rating": 4.6,
      "reviews": 184,
      "stock": 42,
      "featured": true,
      "new": false,
      "description": "This 'Salaam' hijab is more than just a piece of clothing—it’s a symbol of hope, solidarity, and the strength of women. The word 'Salaam,' meaning peace, is beautifully woven into the fabric, serving as a gentle reminder of the power of kindness and unity. But what truly makes this hijab special is the cause it represents. Each purchase helps support the women of Gaza, who have shown incredible resilience and strength despite the challenges they face. By wearing this hijab, you're not only embracing a beautiful design, but you're also standing alongside these women, offering them your support and love. The soft, lightweight fabric makes it a joy to wear, while the deeper meaning behind it fills your heart with purpose. This hijab is a way to wear your values and contribute to a brighter, more peaceful future for those who need it most. <br><br> Material: 100% Modal. <br><br>This hijab is not only stylish but also easy to care for. Simply hand wash it in cold water and hang it to dry for long-lasting softness and color.",
      "image": "./assets/images/salaam.webp"
    }
  ]
}